list_of_dicts = [
    {
        'Волгоград': 6,
        'Екатеринбург': 3,
        'Краснодар': 1,
        'Санкт-Петербург': 5,
        'Саратов': 2,
        'Тюмень': 6,
        'Уфа': 8
    },
    {
        'Волгоград': 1, 
        'Махачкала': 7, 
        'Новосибирск': 6, 
        'Самара': 7, 
        'Уфа': 5
    },
    {
        'Барнаул': 2,
        'Воронеж': 8,
        'Краснодар': 9,
        'Красноярск': 4,
        'Махачкала': 1,
        'Оренбург': 2,
        'Ростов-на-Дону': 1,
        'Самара': 1,
        'Тюмень': 2,
        'Хабаровск': 1
    },
    {
        'Владивосток': 3,
        'Воронеж': 4,
        'Ижевск': 9,
        'Иркутск': 6,
        'Казань': 2,
        'Краснодар': 5,
        'Нижний Новгород': 7,
        'Ульяновск': 1,
        'Челябинск': 7
    }
]
my_list = []
city = set()
for dicts in list_of_dicts:
    city.update(list(dicts))
list_of_dicts_new = dict.fromkeys(city,[]) 
for dicts in list_of_dicts:
    for key in dicts:
        my_tuple = (key,dicts[key])
        my_list.append(my_tuple)
for key,value in list_of_dicts_new.items():
    for key1,value1 in my_list:
        # print(key1,value1)
        if key == key1:
            value2=value.copy()
            value2.append(value1)
            list_of_dicts_new[key]=value2
            value=value2      
for key in list_of_dicts_new:
    print(f'{key}: {set(list_of_dicts_new[key])}') 

# Санкт-Петербург: {5}
# Красноярск: {4}
# Екатеринбург: {3}
# Саратов: {2}
# Уфа: {8, 5}
# Ростов-на-Дону: {1}
# Иркутск: {6}
# Владивосток: {3}
# Новосибирск: {6}
# Оренбург: {2}
# Нижний Новгород: {7}
# Хабаровск: {1}
# Волгоград: {1, 6}
# Челябинск: {7}
# Казань: {2}
# Самара: {1, 7}
# Ижевск: {9}
# Тюмень: {2, 6}
# Воронеж: {8, 4}
# Ульяновск: {1}
# Краснодар: {1, 5, 9}
# Махачкала: {1, 7}
# Барнаул: {2}        