def deck() ->GeneratorExit:
    """создаёт упорядоченную колоду карт"""
    suit_of_cards = iter([ "черви", "бубны","пики","трефы"]) 
    card_value = [*range(2,15)]*4
    for n in card_value:
        if n == 2 :
            a =  next(suit_of_cards, 'STOP')
        b = n           
        yield b,a
        
# >>> list(deck())[5::13]
# [(7, 'черви'), (7, 'бубны'), (7, 'пики'), (7, 'трефы')]    

# >>> list(deck())[10:16]
# [(12, 'черви'), (13, 'черви'), (14, 'черви'), (2, 'бубны'), (3, 'бубны'), (4, 'бубны')]