text = input('Введите текст: \n')
punctuation = '.,:;!?-—\'\"()*'
words = [ word.strip(punctuation) for word in text.split() ]
print('Текст без знаков препинания: ')
print(" ".join(words))


# Введите текст:
# Было темно в гостиной. Лаптев, не садясь и держа шляпу в руках, стал извиняться за беспокойство; он спросил, что делать, чтобы сестра спала по ночам, и отчего она так страшно худеет, и его смущала мысль, что, кажется, эти самые вопросы он уже задавал доктору сегодня во время его утреннего визита.
# Текст без знаков препинания:
# Было темно в гостиной Лаптев не садясь и держа шляпу в руках стал извиняться за беспокойство он спросил что делать чтобы сестра спала по ночам и отчего она так страшно худеет и его смущала мысль что кажется эти самые вопросы он уже задавал доктору сегодня во время его утреннего визита
